import math
import numpy as np
import matplotlib as mpl
import matplotlib.pyplot as plt
import matplotlib.lines as mlines
from mpmath import *
import scipy.constants as constant

dictionary = {
    'lam': [ 'none' , 'mk'],  # (дано) лямбда = длина волны \мкм
    'fTop': [ 'none' , 'k'],  # (дано) верхняя граница частоты полосы \ кГц
    'fBottom': [ 'none' , 'k'],  # (дано) нижняя граница частоты полосы \кГЦ
    'dFi': [ 'none' , 'm'],  # (дано) расходимость луча \ мрад
    'Fel': [ 'none' , 'Si'],  # (дано) (мощность) поток излучения лазера \Вт
    'Wel': [ 'none' , 'k'],  # (мб дано - взаимоИскл с Fel) (энергия)  поток излучения лазера \кило*
    'tImp': [ 'none' , 'Si'],  # время испускания ! - обязательно если Wel != nan
    'Rl': [ 'none' , 'k'],  # (дано) расстояние до источника лазерного излучения
    'Rf': [ 'none' , 'k'],  # (дано) расстояние до источника фонового излучения \ км
    'Fef': [ 'none' , 'k'],  # (дано)  поток излучения фонового источника \кВт
    'Tf': [ 'none' , 'Si'],  # (дано) температура фонового источника \K
    'Ta': [mpf(2850), 'Si'],  # - вообще константа)
    'D': [ 'none' , 'm'],  # (дано) диаметр зрачка входного объектива \мм
    'k': [ 'none' , '-'],  # (дано) коэффициент пропускания объектива
    #
    'df': ['none', 'k'],  # полоса частот
    'Fefpr': ['none', '-'],  # поток от фона падающего на фотоприемник приемник
    'Felpr': ['none', '-'],  # поток от лазерного истчоника излучения падающего на фотоприемник приемник



}
conversion = {
    'k': 1000,
    'mk': math.pow(10, -6),
    'm': math.pow(10, -3),
    'Si': 1,
    '-': 1,

}
